Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar
The Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar interface represents any type of wrapper for Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup.

Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar.ControlClicked
Occurs when any of the items in the toolbar is clicked.
The sender parameter represents the clicked item.

Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar.ControlCursorHover
Occurs when the mouse pointer is on top of any of the items in the toolbar.
The sender parameter represents the hovered item.

Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar.ControlStateChanged
Occurs when the state of any of the items in the toolbar is changed.

Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar.Disposed
Occurs when the Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar is disposed.

Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar.Update(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Updates the appearance of the items representing the given group.
updatedGroup: The updated group.

Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar.UpdateSingleControl(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase,Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState)
Updates the appearance of the item representing the given control.
updatedControl: The updated control.
shortState: The Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState to apply on updatedControl as a short lived state.